[net]
# Testing
#batch=1
#subdivisions=1
# Training
batch=16
subdivisions=8
width=608
height=608
channels=3
momentum=0.949
decay=0.00005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.000261
burn_in=1000
max_batches = 30000
policy=steps
steps=6000,12000,24000
scales=.5,.5,.5

label_smooth_eps=0.1
mosaic=0


### CSPN ###

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=mish

# Downsample

[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=mish
#                 #2
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

[route]
layers = -2

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=mish

##  split attention
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=128
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=64

[activation]
activation=normalize_channels_softmax

[view]
channel=128
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-11
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

[route]
layers = -1,-21

#                  #24
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

# Downsample

[convolutional]
batch_normalize=1
filters=128
size=3
stride=2
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

[route]
layers = -2

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

##  split attention
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=128
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=64

[activation]
activation=normalize_channels_softmax

[view]
channel=128
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-11
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

##  split attention
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=128
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=64

[activation]
activation=normalize_channels_softmax

[view]
channel=128
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-11
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

[route]
layers = -1,-38

#                  #65
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

# Downsample

[convolutional]
batch_normalize=1
filters=256
size=3
stride=2
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

[route]
layers = -2

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

##  split attention
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=256
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=128

[activation]
activation=normalize_channels_softmax

[view]
channel=256
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-11
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

##  split attention
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=256
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=128

[activation]
activation=normalize_channels_softmax

[view]
channel=256
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-11
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

##  split attention
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=256
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=128

[activation]
activation=normalize_channels_softmax

[view]
channel=256
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-11
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

##  split attention
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=256
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=128

[activation]
activation=normalize_channels_softmax

[view]
channel=256
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-11
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear


[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

##  split attention
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=256
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=128

[activation]
activation=normalize_channels_softmax

[view]
channel=256
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-11
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

##  split attention
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=256
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=128

[activation]
activation=normalize_channels_softmax

[view]
channel=256
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-11
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

##  split attention
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=256
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=128

[activation]
activation=normalize_channels_softmax

[view]
channel=256
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-11
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

##  split attention
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=256
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=128

[activation]
activation=normalize_channels_softmax

[view]
channel=256
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-11
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

[route]
layers=-1,-140

#                    #208
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# Downsample

[convolutional]
batch_normalize=1
filters=512
size=3
stride=2
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

[route]
layers = -2

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

##  split attention 1
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=512
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=256

[activation]
activation=normalize_channels_softmax

[view]
channel=512
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-11
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

##  split attention 2
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=512
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=256

[activation]
activation=normalize_channels_softmax

[view]
channel=512
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-11
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

##  split attention 3
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=512
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=256

[activation]
activation=normalize_channels_softmax

[view]
channel=512
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-11
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

##  split attention 4
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=512
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=256

[activation]
activation=normalize_channels_softmax

[view]
channel=512
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-11
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

##  split attention 5
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=512
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=256

[activation]
activation=normalize_channels_softmax

[view]
channel=512
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-11
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear


[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

##  split attention 6
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=512
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=256

[activation]
activation=normalize_channels_softmax

[view]
channel=512
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-10
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear


[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

##  split attention 7
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=512
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=256

[activation]
activation=normalize_channels_softmax

[view]
channel=512
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-11
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear


[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

##  split attention 8
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=512
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=256

[activation]
activation=normalize_channels_softmax

[view]
channel=512
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-11
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

[route]
layers = -1,-140

#                   #351
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

# Downsample

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=2
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

[route]
layers = -2

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

##  split attention 1
[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=1024
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=512

[activation]
activation=normalize_channels_softmax

[view]
channel=1024
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-11
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

##  split attention 2
[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=1024
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=512

[activation]
activation=normalize_channels_softmax

[view]
channel=1024
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-11
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

##  split attention 3
[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=1024
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=512

[activation]
activation=normalize_channels_softmax

[view]
channel=1024
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-11
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

##  split attention 4
[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
groups=2
activation=mish

[route]
layers=-1
group_id=0
groups=2

[route]
layers=-2
group_id=1
groups=2

[shortcut]
from=-2
activation=linear

[avgpool]

## Dense fc1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

## Dense fc2
[convolutional]
filters=1024
size=1
stride=1
pad=1
activation=linear

[view]
channel=2
width=512

[activation]
activation=normalize_channels_softmax

[view]
channel=1024
width=1

[route]
layers=-1
group_id=0
groups=2

[scale_channels]
from=-10
scale_wh=0

[route]
layers=-3
group_id=1
groups=2

[scale_channels]
from=-11
scale_wh=0

[shortcut]
from=-3
activation=linear

[shortcut]
from=-17
activation=linear

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

[route]
layers = -1,-72
#                   #426
[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=mish

### End CSPN ###

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=mish
#                   #429
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

[upsample]
stride=2

[route]
layers = -1, 351

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=mish

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=mish
#                   #437
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

[upsample]
stride=2

[route]
layers = -1, 208

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=mish

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=mish
#                   #445
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish
#                   #add 446
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=mish

### ASFF 1 ###
#                  #447 A
[route]
layers=429

[convolutional]
batch_normalize=1
size=1
stride=1
filters=16
activation=mish
#                 #449 B -> A (down-sampling with 1/2 ratio)
[route]
layers=437

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=512
activation=mish

[convolutional]
batch_normalize=1
size=1
stride=1
filters=16
activation=mish
#				#452 C-> A (down-sampling with 1/4 ratio)
[route]
layers=446

[maxpool]
size=3
stride=2

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=512
activation=mish

[convolutional]
batch_normalize=1
size=1
stride=1
filters=16
activation=mish

[route]
layers=-8,-5,-1

[convolutional]
stride=1
size=1
filters=3
activation=normalize_channels_softmax

[route]
layers=-1
group_id=0
groups=3

[scale_channels]
from=-12
scale_wh=1

[route]
layers=-3
group_id=1
groups=3

[scale_channels]
from=-11
scale_wh=1

[route]
layers=-5
group_id=2
groups=3

[scale_channels]
from=-9
scale_wh=1

[shortcut]
from=-3
activation=linear
#                    #465
[shortcut]
from=-6
activation=linear
######################

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=mish

[convolutional]
size=1
stride=1
pad=1
filters=18
activation=linear

[yolo]
mask = 4, 5
anchors = 81,86, 90,140, 100,110, 110,60, 125,125, 264,60
classes=4
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=0
scale_x_y = 1.05
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
uc_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6
beta1=0.6

### ASFF 2 ###
#                  #469 A -> B (compress channel, upsample)
[route]
layers=429

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=256
activation=mish

[upsample]
stride=2

[convolutional]
batch_normalize=1
size=1
stride=1
filters=16
activation=mish

#                  #473 B
[route]
layers=437

[convolutional]
batch_normalize=1
size=1
stride=1
filters=16
activation=mish

#                 #475 C -> B (down-sampling with 1/2 ratio)
[route]
layers=446

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=256
activation=mish

[convolutional]
batch_normalize=1
size=1
stride=1
filters=16
activation=mish

[route]
layers=-6,-4,-1

[convolutional]
stride=1
size=1
filters=3
activation=normalize_channels_softmax

[route]
layers=-1
group_id=0
groups=3

[scale_channels]
from=-10
scale_wh=1

[route]
layers=-3
group_id=1
groups=3

[scale_channels]
from=-10
scale_wh=1

[route]
layers=-5
group_id=2
groups=3

[scale_channels]
from=-9
scale_wh=1

[shortcut]
from=-3
activation=linear
#                   #487
[shortcut]
from=-6
activation=linear
######################

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=mish

[convolutional]
size=1
stride=1
pad=1
filters=18
activation=linear

[yolo]
mask = 2, 3
anchors = 81,86, 90,140, 100,110, 110,60, 125,125, 264,60
classes=4
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=0
scale_x_y = 1.1
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
uc_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6
beta1=0.6

### ASFF 3 ###
#                  #491 A -> C (compress channel, upsample)
[route]
layers=429

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=256
activation=mish

[upsample]
stride=4

[convolutional]
batch_normalize=1
size=1
stride=1
filters=16
activation=mish
#                    #495 B -> C
[route]
layers=437

[upsample]
stride=2

[convolutional]
batch_normalize=1
size=1
stride=1
filters=16
activation=mish
#                   #498 C
[route]
layers=446

[convolutional]
batch_normalize=1
size=1
stride=1
filters=16
activation=mish

[route]
layers=-6,-3,-1

[convolutional]
stride=1
size=1
filters=3
activation=normalize_channels_softmax

[route]
layers=-1
group_id=0
groups=3

[scale_channels]
from=-10
scale_wh=1

[route]
layers=-3
group_id=1
groups=3

[scale_channels]
from=-9
scale_wh=1

[route]
layers=-5
group_id=2
groups=3

[scale_channels]
from=-9
scale_wh=1

[shortcut]
from=-3
activation=linear

[shortcut]
from=-6
activation=linear

######################
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=mish

[convolutional]
size=1
stride=1
pad=1
filters=18
activation=linear


[yolo]
mask = 0, 1
anchors = 81,86, 90,140, 100,110, 110,60, 125,125, 264,60
classes=4
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=0
scale_x_y = 1.2
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
uc_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6
beta1=0.6